ERP.belugaerp/src/Enums/бг_РезультатыСогласования/бг_РезультатыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_РезультатыСогласования</name>
  <enumValues>
    <name>Автоотказ</name>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
  </enumValues>
  <enumValues>
    <name>Автосогласование</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>СогласованоПринудительно</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_РезультатыСогласования/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает массив результатов согласования, определяющих, что заказ согласован
//
// Возвращаемое значение:
//   - Массив 
//
Функция СтатусыСогласовано() Экспорт

	СтатусыСогласованияСогласовано = Новый Массив;
	СтатусыСогласованияСогласовано.Добавить(Перечисления.бг_РезультатыСогласования.Согласовано);
	СтатусыСогласованияСогласовано.Добавить(Перечисления.бг_РезультатыСогласования.СогласованоПринудительно);
	СтатусыСогласованияСогласовано.Добавить(Перечисления.бг_РезультатыСогласования.АвтоСогласование);
	
	Возврат СтатусыСогласованияСогласовано;

КонецФункции
	
#КонецОбласти
